qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Src/py32f403_hal_canfd.c
/**
  ******************************************************************************
  * @file    py32f403_hal_canfd.c
  * @author  MCU Application Team
  * @brief   CANFD HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the CAN with Flexible Data-rate (CANFD).
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Errors functions
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32f4xx_hal.h"

/** @addtogroup PY32F403_HAL_Driver
  * @{
  */

/** @defgroup CANFD CANFD
  * @brief CANFD driver modules
  * @{
  */

#ifdef  HAL_CANFD_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private defines ------------------------------------------------------------*/
/** @defgroup CANFD_Private_Constants CANFD Private Constants
  * @{
  */
#define CANFD_TIMEOUT_VALUE 10U
#define CANFD_LLC_EXTENDED_ID_MSK              (0x1FFFFFFFU)
#define CANFD_LLC_STANDARD_ID_MSK              (0x7FF<<18)
#define CANFD_LLC_FORMAT_MSK                   (0x1F1707FF)
/**
  * @}
  */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup CANFD_Private_Variables CANFD Private Variables
  * @{
  */
static const uint8_t DLCtoBytes[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 12, 16, 20, 24, 32, 48, 64};
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup CANFD_Private_Functions CANFD Private Functions
  * @{
  */
static void CANFD_CopyMessageToFifo(CANFD_HandleTypeDef *hcanfd, CANFD_TxHeaderTypeDef *pTxHeader, uint8_t *pTxData);
/**
  * @}
  */

/** @defgroup CANFD_Exported_Functions CANFD Exported Functions
  * @{
  */

/** @defgroup CANFD_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
  * @{
  */

/**
  * @brief  CANFD init
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_Init(CANFD_HandleTypeDef *hcanfd)
{
  uint32_t tickstart;

  /* Check CANFD handle */
  if (hcanfd == NULL)
  {
    return HAL_ERROR;
  }

  /* Check function parameters */
  assert_param(IS_CANFD_ALL_INSTANCE(hcanfd->Instance));
  assert_param(IS_CANFD_FRAME_FORMAT(hcanfd->Init.FrameFormat));
  assert_param(IS_CANFD_MODE(hcanfd->Init.Mode));
  assert_param(IS_CANFD_CANFD_PROTOCOL(hcanfd->Init.CANFDProtocol));
  assert_param(IS_CANFD_CKDIV(hcanfd->Init.Prescaler));
  assert_param(IS_CANFD_NOMINAL_SJW(hcanfd->Init.NominalSyncJumpWidth));
  assert_param(IS_CANFD_NOMINAL_TSEG1(hcanfd->Init.NominalTimeSeg1));
  assert_param(IS_CANFD_NOMINAL_TSEG2(hcanfd->Init.NominalTimeSeg2));
  if (hcanfd->Init.FrameFormat == CANFD_FRAME_FD_BRS)
  {
    assert_param(IS_CANFD_DATA_SJW(hcanfd->Init.DataSyncJumpWidth));
    assert_param(IS_CANFD_DATA_TSEG1(hcanfd->Init.DataTimeSeg1));
    assert_param(IS_CANFD_DATA_TSEG2(hcanfd->Init.DataTimeSeg2));
  }
  assert_param(IS_CANFD_SSPOFF(hcanfd->Init.SecondSamplePointOffset));

  if (hcanfd->State == HAL_CANFD_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hcanfd->Lock = HAL_UNLOCKED;

    /* Init the low level hardware: CLOCK, NVIC */
    HAL_CANFD_MspInit(hcanfd);
  }

  /* forces to reset state */
  SET_BIT(hcanfd->Instance->MCR, CANFD_MCR_RESET);

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait until the RESET bit into MCR register is set */
  while ((hcanfd->Instance->MCR & CANFD_MCR_RESET) == 0U)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > CANFD_TIMEOUT_VALUE)
    {
      /* Update error code */
      hcanfd->ErrorCode |= HAL_CANFD_ERROR_TIMEOUT;

      /* Change CAN state */
      hcanfd->State = HAL_CANFD_STATE_ERROR;

      return HAL_ERROR;
    }
  }

  /* Specifies the number of time quanta in Bit */  
  hcanfd->Instance->ACBTR = (((hcanfd->Init.NominalSyncJumpWidth - 1U) << CANFD_ACBTR_AC_SJW_Pos) + \
                             ((hcanfd->Init.NominalTimeSeg1 - 2U) << CANFD_ACBTR_AC_SEG_1_Pos) + \
                             ((hcanfd->Init.NominalTimeSeg2 - 1U) << CANFD_ACBTR_AC_SEG_2_Pos));

  /* Specifies functions related to FD frames  */
  if (hcanfd->Init.FrameFormat == CANFD_FRAME_CLASSIC)
  {
    hcanfd->Instance->FDBTR = hcanfd->Instance->ACBTR;
  }
  else
  {
    if (hcanfd->Init.FrameFormat == CANFD_FRAME_FD_NO_BRS)
    {
      hcanfd->Instance->FDBTR = hcanfd->Instance->ACBTR;
    }
    else
    {
      hcanfd->Instance->FDBTR = (((hcanfd->Init.DataSyncJumpWidth - 1U) << CANFD_FDBTR_FD_SJW_Pos) + \
                                 ((hcanfd->Init.DataTimeSeg1 - 2U) << CANFD_FDBTR_FD_SEG_1_Pos) + \
                                 ((hcanfd->Init.DataTimeSeg2 - 1U) << CANFD_FDBTR_FD_SEG_2_Pos));
    }
    /* Specifies Bosch CAN-FD or 11898-1:2015 CAN-FD */
    MODIFY_REG(hcanfd->Instance->MCR, CANFD_MCR_FD_ISO, hcanfd->Init.CANFDProtocol);

    /* Specifies secondary sample point(SSP) and  the length of a time quantum(PRESC)*/
    MODIFY_REG(hcanfd->Instance->RLSSP, CANFD_RLSSP_FD_SSPOFF, (hcanfd->Init.SecondSamplePointOffset << CANFD_RLSSP_FD_SSPOFF_Pos));
  }
  
