qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Src/py32f403_hal_canfd.c
  MODIFY_REG(hcanfd->Instance->RLSSP, CANFD_RLSSP_PRESC, ((hcanfd->Init.Prescaler - 1U) << CANFD_RLSSP_PRESC_Pos));

  /* Initialize the error code */
  hcanfd->ErrorCode = HAL_CANFD_ERROR_NONE;

  /* Initialize the CANFD state */
  hcanfd->State = HAL_CANFD_STATE_READY;

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  CANFD MSP Init.
  * @param  hcan  Pointer to a CANFD_HandleTypeDef structure that contains
  *                the configuration information for the specified CANFD module.
  * @retval None
  */
__weak void HAL_CANFD_MspInit(CANFD_HandleTypeDef *hcan)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcan);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_CANFD_MspInit could be implemented in the user file
   */
}

#if USE_HAL_CANFD_REGISTER_CALLBACKS == 1
/**
  * @brief  Register a CANFD CallBack.
  *         To be used instead of the weak predefined callback
  * @param  hcanfd pointer to a CANFD_HandleTypeDef structure that contains
  *         the configuration information for CANFD module
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_CANFD_RX_COMPLETE_CB_ID             CANFD Rx complete callback ID
  *           @arg @ref HAL_CANFD_RX_FIFO_ALMOST_FULL_CB_ID     CANFD Rx fifo almost full callback ID 
  *           @arg @ref HAL_CANFD_RX_FIFO_FULL_CB_ID            CANFD Rx fifo full callback ID 
  *           @arg @ref HAL_CANFD_PTB_TX_COMPLETE_CB_ID         CANFD PTB Tx complete callback ID 
  *           @arg @ref HAL_CANFD_STB_TX_COMPLETE_CB_ID         CANFD STB Tx complete callback ID
  *           @arg @ref HAL_CANFD_TX_ABORT_CB_ID                CANFD Tx abort callback ID         
  *           @arg @ref HAL_CANFD_RX_FIFO_OVERFLOW_CB_ID        CANFD Rx fifo overflow callback ID 
  *           @arg @ref HAL_CANFD_ARBITRATION_LOST_CB_ID        CANFD Arbitration lost callback ID 
  *           @arg @ref HAL_CANFD_PASSIVE_ERROR_CB_ID           CANFD Passive error callback ID
  *           @arg @ref HAL_CANFD_BUS_ERROR_CB_ID               CANFD Bus error callback ID 
  *           @arg @ref HAL_CANFD_ERROR_CHANGE_CB_ID            CANFD Error change callback ID 
  *           @arg @ref HAL_CANFD_TT_RX_TIME_TRIG_CB_ID         CANFD TT Rx time trig callback ID
  *           @arg @ref HAL_CANFD_TT_TX_SINGLE_TRIG_CB_ID       CANFD TT Tx single trig callback ID
  *           @arg @ref HAL_CANFD_TT_TX_START_TRIG_CB_ID        CANFD TT Tx start trig callback ID 
  *           @arg @ref HAL_CANFD_TT_TX_STOP_TRIG_CB_ID         CANFD TT Tx stop trig callback ID
  *           @arg @ref HAL_CANFD_TT_TIMESTAMP_WRAPAROUND_CB_ID CANFD TT timestamp wraparound callback ID
  *           @arg @ref HAL_CANFD_TT_TRIG_ERROR_CB_ID           CANFD TT trig error callback ID
  *           @arg @ref HAL_CANFD_MSPINIT_CB_ID                 MspInit callback ID
  *           @arg @ref HAL_CANFD_MSPDEINIT_CB_ID               MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_RegisterCallback(CANFD_HandleTypeDef *hcanfd, HAL_CANFD_CallbackIDTypeDef CallbackID, void (* pCallback)(CANFD_HandleTypeDef *_hCANFD))
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  if (hcanfd->State == HAL_CANFD_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_CANFD_RX_COMPLETE_CB_ID :
        hfdcan->RxCpltCallback = pCallback;
        break;

      case HAL_CANFD_RX_FIFO_ALMOST_FULL_CB_ID :
        hfdcan->RxFifoAlmostFullCallback = pCallback;
        break;

      case HAL_CANFD_RX_FIFO_FULL_CB_ID :
        hfdcan->RxFifoFullCallback = pCallback;
        break;

      case HAL_CANFD_PTB_TX_COMPLETE_CB_ID :
        hfdcan->PtbTxCpltCallback = pCallback;
        break;

      case HAL_CANFD_STB_TX_COMPLETE_CB_ID :
        hfdcan->StbTxCpltCallback = pCallback;
        break;

      case HAL_CANFD_TX_ABORT_CB_ID :
        hfdcan->TxAbortCallback = pCallback;
        break;

      case HAL_CANFD_RX_FIFO_OVERFLOW_CB_ID :
        hfdcan->RxFifoOverflowCallback = pCallback;
        break;

      case HAL_CANFD_ARBITRATION_LOST_CB_ID :
        hfdcan->ArbitrationLostCallback = pCallback;
        break;

      case HAL_CANFD_PASSIVE_ERROR_CB_ID :
        hfdcan->PassiveErrorCallback = pCallback;
        break;

      case HAL_CANFD_BUS_ERROR_CB_ID :
        hfdcan->BusErrorCallback = pCallback;
        break;

      case HAL_CANFD_ERROR_CHANGE_CB_ID :
        hfdcan->ErrorChangeCallback = pCallback;
        break;

      case HAL_CANFD_TT_RX_TIME_TRIG_CB_ID :
        hfdcan->TT_RxTimeTrigCallback = pCallback;
        break;

      case HAL_CANFD_TT_TX_SINGLE_TRIG_CB_ID :
        hfdcan->TT_TxSingleTrigCallback = pCallback;
        break;

      case HAL_CANFD_TT_TX_START_TRIG_CB_ID :
        hfdcan->TT_TxStartTrigCallback = pCallback;
        break;

      case HAL_CANFD_TT_TX_STOP_TRIG_CB_ID :
        hfdcan->TT_TxStopTrigCallback = pCallback;
        break;

      case HAL_CANFD_TT_TIMESTAMP_WRAPAROUND_CB_ID :
        hfdcan->TT_TimestampWraparoundCallback = pCallback;
        break;

      case HAL_CANFD_TT_TRIG_ERROR_CB_ID :
        hfdcan->TT_TrigErrorCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hfdcan->ErrorCode |= HAL_CANFD_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (hcanfd->State == HAL_CANFD_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_CANFD_MSPINIT_CB_ID :
        hcanfd->MspInitCallback = pCallback;
        break;

      case HAL_CANFD_MSPDEINIT_CB_ID :
        hcanfd->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hcanfd->ErrorCode |= HAL_CANFD_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hfdcan->ErrorCode |= HAL_CANFD_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

