qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Src/py32f403_hal_canfd.c
    if (pTTConfig->RefMessageIdType == CANFD_STANDARD_ID)
    {
      WRITE_REG(hcanfd->Instance->REFMSG, (pTTConfig->RefMessageId));
    }
    else
    {
      WRITE_REG(hcanfd->Instance->REFMSG, (0x80000000 | pTTConfig->RefMessageId));
    }

    MODIFY_REG(hcanfd->Instance->TTTR, CANFD_TTTR_TT_WTRIG,(pTTConfig->WatchTrigTime<<CANFD_TTTR_TT_WTRIG_Pos));

    MODIFY_REG(hcanfd->Instance->TTCR, (CANFD_TTCR_T_PRESC | CANFD_TTCR_TEW), (pTTConfig->Prescaler | (pTTConfig->TxEnableWindow << CANFD_TTCR_TEW_Pos)));

    SET_BIT(hcanfd->Instance->TTCR, CANFD_TTCR_TTEN);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Add a message to the time trig FIFO
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @param  txHeader pointer to an CANFD_TxHeaderTypeDef structure.
  * @param  pData pointer to a buffer containing the payload of the Tx frame.
  * @param  slotIndex the fifo index
  *         This parameter can be a value of @arg CANFD_TT_FIFO_INDEX.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_TT_AddMessageToFifo(CANFD_HandleTypeDef *hcanfd, CANFD_TxHeaderTypeDef *txHeader, uint8_t *pData, uint32_t slotIndex)
{
  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    MODIFY_REG(hcanfd->Instance->TTCR, CANFD_TTCR_TBPTR, (slotIndex<<CANFD_TTCR_TBPTR_Pos));

    if (READ_BIT(hcanfd->Instance->MCR, CANFD_MCR_TSFF) == 0)
    {
      /* Write data to the FIFO */
      CANFD_CopyMessageToFifo(hcanfd, txHeader, pData);

      /* Notifies CANFD that the slot is filled */
      SET_BIT(CANFD->TTCR, CANFD_TTCR_TBF);
    }
    else
    {
      /* Update error code */
      hcanfd->ErrorCode |= HAL_CANFD_ERROR_FIFO_FULL;

      return HAL_ERROR;
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Activate TTCAN Trigger Request.
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @param  triggerType TTCAN trigger type.
  *         This parameter can be a value of @arg CANFD_TT_trigger_type.
  * @param  trigTime TTCAN trigger time.
  * @param  slotIndex the fifo index
  *         This parameter can be a value of @arg CANFD_TT_FIFO_INDEX.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_TT_ActivateTrigRequest(CANFD_HandleTypeDef *hcanfd, uint32_t triggerType, uint32_t trigTime, uint32_t slotIndex)
{
  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    MODIFY_REG(CANFD->TTCR, (CANFD_TTCR_TTPTR | CANFD_TTCR_TTYPE), ((slotIndex<<CANFD_TTCR_TTPTR_Pos) | triggerType));

    MODIFY_REG(CANFD->TTTR, CANFD_TTTR_TT_TRIG, (trigTime<<CANFD_TTTR_TT_TRIG_Pos));

    hcanfd->LastTimeTrigType = triggerType;

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  TTCAN mode,set TB slot to empty.
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @param  slotIndex TB SLOT index.
  *         This parameter can be a value of @arg CANFD_TT_FIFO_INDEX.
  * @param  slotState Set TB SLOT state
  *         This parameter can be a value of @arg CANFD_TT_FIFO_State_Set.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_TT_ConfigTxBufferState(CANFD_HandleTypeDef *hcanfd, uint32_t slotIndex, uint32_t slotState)
{
  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    MODIFY_REG(hcanfd->Instance->TTCR, CANFD_TTCR_TBPTR, (slotIndex<<CANFD_TTCR_TBPTR_Pos));

    MODIFY_REG(CANFD->TTCR, (CANFD_TTCR_TBE | CANFD_TTCR_TBF), slotState);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Start the CANFD module.
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_Start(CANFD_HandleTypeDef *hcanfd)
{
  uint32_t tickstart;

  if (hcanfd->State == HAL_CANFD_STATE_READY)
  {
    /* Change CANFD peripheral state */
    hcanfd->State = HAL_CANFD_STATE_BUSY;

    /* Request leave initialisation */
    CLEAR_BIT(hcanfd->Instance->MCR, CANFD_MCR_RESET);

    /* Get tick */
    tickstart = HAL_GetTick();

    /* Wait until the RESET bit into MCR register is set */
    while ((hcanfd->Instance->MCR & CANFD_MCR_RESET) != 0)
    {
      /* Check for the Timeout */
      if ((HAL_GetTick() - tickstart) > CANFD_TIMEOUT_VALUE)
      {
        /* Update error code */
        hcanfd->ErrorCode |= HAL_CANFD_ERROR_TIMEOUT;

        /* Change CAN state */
        hcanfd->State = HAL_CANFD_STATE_ERROR;

        return HAL_ERROR;
      }
    }
    
    /* Specifies the CANFD working mode */
    if (hcanfd->Init.Mode == CANFD_MODE_RESTRICTED_OPERATION)
    {
      SET_BIT(hcanfd->Instance->TSNCR, CANFD_TSNCR_ROP);
    }
    else
    {
      MODIFY_REG(hcanfd->Instance->MCR, (CANFD_MCR_LBME | CANFD_MCR_LBMI | CANFD_MCR_SACK | CANFD_MCR_LOM), \
                 hcanfd->Init.Mode);
    }

    /* Reset the CANFD ErrorCode */
    hcanfd->ErrorCode = HAL_CANFD_ERROR_NONE;

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_READY;

    return HAL_ERROR;
  }
}

/**
  * @brief  Enable interrupts.
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @param  activeITs indicates which interrupts will be enabled.
  *         This parameter can be any combination of @arg CANFD_Interrupts.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_ActivateNotification(CANFD_HandleTypeDef *hcanfd, uint32_t activeITs)
{
  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    __HAL_CANFD_ENABLE_IT(hcanfd, activeITs);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Disable interrupts.
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @param  inactiveITs indicates which interrupts will be disabled.
  *         This parameter can be any combination of @arg CANFD_Interrupts.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_DeactivateNotification(CANFD_HandleTypeDef *hcanfd, uint32_t inactiveITs)
{
  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    __HAL_CANFD_DISABLE_IT(hcanfd, inactiveITs);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  CANFD enter standby mode.
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_EnterStandbyMode(CANFD_HandleTypeDef *hcanfd)
{
  uint32_t tickstart;

  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    SET_BIT(hcanfd->Instance->MCR, CANFD_MCR_STBY);

    /* Get tick */
    tickstart = HAL_GetTick();

    while (READ_BIT(hcanfd->Instance->MCR, CANFD_MCR_STBY) == 0)
    {
      /* Check for the Timeout */
      if ((HAL_GetTick() - tickstart) > CANFD_TIMEOUT_VALUE)
      {
        /* Update error code */
        hcanfd->ErrorCode |= HAL_CANFD_ERROR_TIMEOUT;
        
        return HAL_ERROR;
      }
      SET_BIT(hcanfd->Instance->MCR, CANFD_MCR_STBY);
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  CANFD exit standby mode.
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_ExitStandbyMode(CANFD_HandleTypeDef *hcanfd)
{
  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    CLEAR_BIT(hcanfd->Instance->MCR, CANFD_MCR_STBY);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Get protocol status.
  * @param  hcanfd pointer to an FDCAN_HandleTypeDef structure that contains
  *         the configuration information for the specified FDCAN.
  * @param  ProtocolStatus pointer to an FDCAN_ProtocolStatusTypeDef structure.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_GetProtocolStatus(CANFD_HandleTypeDef *hcanfd, CANFD_ProtocolStatusTypeDef *ProtocolStatus)
{
  uint32_t StatusReg;

  /* Read the protocol status register */
  StatusReg = READ_REG(hcanfd->Instance->WECR);

